Revit 2024 API
ExternallyTaggedBRep.GetTaggedGeometry Method
 Returns the externally tagged geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public GeometryObject GetTaggedGeometry(
	ExternalGeometryId externalId
)
Visual Basic
Public Function GetTaggedGeometry ( _
	externalId As ExternalGeometryId _
) As GeometryObject
Visual C++
public:
GeometryObject^ GetTaggedGeometry(
	ExternalGeometryId^ externalId
)
Parameters
externalId
Type: Autodesk.Revit.DB.ExternalGeometryId
 An external tag that may match a geometry object (i.e face/edge) in this Solid.
Return Value
 Returns the geometry object that matches the external tag. If no such object is found, this method will return null.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace